<?php

return [
    'fields' => [
        'firstname' => 'Имя',
        'lastname' => 'Фамилия',
        'middlename' => 'Отчество',
        'phone' => 'Номер телефона',
        'email' => 'Email',
        'password' => 'Пароль',
        'userName' => 'Имя',
        'promocode' => 'Промокод',
        'link' => 'Ссылка',
        'barcode' => 'Штрихкод',
        'text1' => 'text1',
        'text2' => 'text2',
        'text3' => 'text3',
        'text4' => 'text4',
        'terms' => 'Условия использования',
        'number' => 'Номер',
        'nominal' => 'Номинал',
        'until_date' => 'Дата до',
        'company_external_id' => 'Кабинет поставщика',
        'sex' => 'Пол',
        'type' => 'Тип',

        'card_number' => 'Номер карты',
        'snils' => 'СНИЛС',
        'amount' => 'Сумма',
        'passport_number' => 'Номер паспорта',
        'passport_series' => "Серия паспорта",
        'code_activation' => 'Код активации',
        'additional_password' => 'Дополнительный пароль',

        'payment' => 'Способ оплаты',
        'delivery' => 'Способ доставки',
        'city' => 'Город',
        'street' => 'Улица',
        'house' => 'Дом',
        'apartment' => 'Квартира',
        'date' => 'Дата',
        'timestamp' => 'Дата и время',
        'time_date' => 'Дата доставки',

        'inn' => 'ИНН',
        'kpp' => 'КПП',
        'slug' => 'Slug',
        'name' => 'Наименование',
        'title' => 'Заголовок',
        'price' => 'Цена',
        'quantity' => 'Количество',
        'image' => 'Изображение',
        'image_main' => 'Главное фото',
        'logo' => 'Лого',
        'number_series' => 'Серийный номер',
        'domain' => 'Домен',
        'secret_key' => 'Секретный ключ',
        'confirmation_code' => 'Код подтверждения',
        'verification_code' => 'Проверочный код',
        'role' => 'Роль',
        'sum' => 'Сумма',
        'comment' => 'Комментарий',
        'description' => 'Описание',

        'preview' => 'Превью',
        'video' => 'Видео',
        'author' => 'Автор',
        'type' => 'Тип',

        'pdf' => 'PDF',
        'cost' => 'Стоимость',
        'visibility' => 'Видимость',
        'auth_background' => 'Фон авторизации и регистрации',
        'position' => 'Должность',
        'sales_representative' => 'Торговый представитель',
        'oferta_accept' => 'Согласие на принятие условий оферты',
        'site_url' => 'Адрес сайта',
        'user_update_password' => 'Пользователь успешно обновлён. Новый пароль отправлен на почту',
        'user_add_password' => 'Пользователь успешно добавлен. Новый пароль отправлен на почту',
        'option' => 'Опциия',
        'referer_to_webhook' => 'Ссылка на вебхук',
        'is_full_report' => 'Полнота отчёта',
        'active' => 'Активность кабинета поставщика',

        'sell' => [
            'date' => 'Дата продажи',
            'article' => 'Артикул продажи'
        ],

        'juridical' => [
            'name' => 'Название юридического лица',
            'form' => 'Форма юридического лица'
        ],

        'shop' => [
            'address' => 'Адрес магазина, улица, дом',
            'name' => 'Название магазина',
        ],

        'address' => [
            'settlement_type' => 'Тип населенного пункта',
            'settlement_name' => 'Название населенного пункта',
        ],

        'product' => [
            'title' => 'Продукт',
            'title_other' => 'Товар'
        ],

        'bank' => [
            'name' => 'Наименование банка',
            'settlement_account' => 'Расчетный счет',
            'correspondent_account' => 'Корреспондентский счет',
            'bik' => 'БИК'
        ],

        'company' => [
            'title' => 'Компания',
            'name' => 'Название компании',
            'name_full' => 'Полное наименование компании'
        ],

        'organisation' => [
            'title' => 'Организация',
            'name' => 'Название организации',
        ],

        'replenishment' => [
            'sum' => 'Сумма пополнения',
            'type' => 'Тип пополнения',
        ],

        'space' => [
            'title' => 'Пространство',
            'type' => 'Тип пространства',
            'entity' => 'Сущность пространства'
        ],

        'card' => [
            'type' => 'Тип карты',
            'code_activation' => 'Код активации карты'
        ],

        'supplier' => [
            'name' => 'Поставщик'
        ],

        'certificate' => [
            'select' => 'Выбор сертификатов',
            'images' => 'Картинки сертификата',
            'no_info' => 'Нет информации о продукте'
        ],

        'pull_card' => [
            'number' => 'Номер сертификата',
            'code' => 'Код сертификата'
        ],

        'sms' => [
            'code' => 'Код из СМС'
        ],

        '1c' => [
            'contractor_id' => 'id контрагента из 1С',
            'order' => 'Заказ в 1С',
            'date' => 'Дата заказ в 1С'
        ],

        'user' => [
            'firstname' => 'Имя пользователя',
            'lastname' => 'Фамилия пользователя',
            'middlename' => 'Отчество пользователя',
        ],

        'lead' => [
            'type' => 'Тип лида'
        ],

        'file' => [
            'file' => 'Файл',
            'name' => 'Имя файла'
        ],

        'user_categories' => 'Категории пользователя',
        'category' => [
            'name' => 'Название категории',
            'slug' => 'Слаг категории',
            'description' => 'Текст категории'
        ],

        'dates' => [
            'start' => 'Дата начала',
            'end' => 'Дата конца',
            'month' => 'Месяц',
        ],
    ],

    'messages' => [
        'additional_password' => [
            'url_pdf' => 'Ссылка обязательная для скачивая либо у вас битая ссылка'
        ],

        'pull_card' => [
            'activation' => [
                'success' => 'Универсальная карта успешно активирована! Пополнение баланса занимает до 5 минут',
            ],
        ],
        'block' => [
            'user_day' => [
                'success' => 'Пользователь заблокирован на сутки',
                'danger' => 'Пользователь уже заблокирован'
            ],
            'user_forever' => [
                'success' => 'Пользователь заблокирован навсегда',
                'danger' => 'Пользователь уже заблокирован'
            ],
            'register_user_day' => [
                'danger' => 'Вы заблокированы на сутки, можете обратиться по телефону 8(495)988-50-95 или на почту hello@vpodarok.ru'
            ],
            'register_user_forever' => [
                'danger' => 'Вы заблокированы навсегда, можете обратиться по телефону 8(495)988-50-95 или на почту hello@vpodarok.ru'
            ]
        ],
        'captcha_exception' => 'Код введён неверно или срок действия кода истёк. Пожалуйста, введите код ещё раз!',
        'captcha_nullable' => 'Капча необязательна',

        'showcase_company_options' => [
            'logical_register' => 'Включить/отключить логический вход',
            'welcome' => 'Мотивационная программа предназначена для сотрудников и/или клиентов компании ',
            'description' => 'Программа проводится с целью повышения лояльности к бренду, увеличения продаж и моментальному
                вознаграждению участников за выполнение целевых действий, предусмотренных условиями программы. Чтобы
                воспользоваться полученными баллами, перейдите в раздел «Каталог призов». Получить информацию о
                начисленных и потраченных баллах вы можете в Личном кабинете в разделе «История начислений и списаний»
                Также в Личном кабинете Вы можете пополнить свой баланс с помощью банковской карты в случае, если
                начисленных баллов не хватает для обмена выбранного приза. За технической поддержкой вы можете
                обратиться по адресу support@i-motivate.ru или позвонив по номеру телефона +74951201889
                (пн-пт, с 9 до 18).',
        ],

        'copy' => [
            'certificates_loading' => 'Ждите окончания копирования сертификатов',
            'certificates_error' => 'К сожалению, не получилось скопировать сертификаты. Попробуйте ещё раз!'
        ],

        'expire' => [
            'pulls' => 'Внимание, заканчиваются пулы '
        ],

        'company_sell' => [
            'report' => 'Отчет формируется и после будет отправлен на почты администраторам',
            'demo' => 'Выгрузка невозможна. Вы в демо режиме',
            'error' => 'Ошибка при формировании отчёта',
            'success' => 'Ожидайте формирование отчёта'
        ],

        'report' => [
            'loading' => 'Ждите окончания создания отчёта'
        ],

        'cart' => [
            'errors' => [
                'phone' => 'Пользователя с указанным номером телефона не существует'
            ]
        ],

        'lead' => [
            'name' => 'Введите имя',
            'phone' => 'Введите номер телефона'
        ],

        'default_messages' => [
            'deleted_successfully' => 'Удалён успешно',
            'created_successfully' => 'Успешно создан',
            'edited_successfully' => 'Изменён успешно',
            'error' => 'Произошла ошибка',
            'internal_error' => 'Произошла внутренняя ошибка!'
        ],

        'settings_saved_successfully' => 'Настройки успешно сохранены',

        'application_for_documents_successfully' => 'Заявка на документы успешно отправлена!',

        'invoicing' => 'Выставление счета',

        'pdf' => [
            'template_not_match' => 'Данный шаблон не подходит, попробуйте другой'
        ],

        'activation' => [
            'success' => 'Ваш заказ успешно принят на обработку! Вы получите сертификат на почту от 5 минут после оформления до 2 часов. Обязательно проверяйте Спам (сертификаты могут "упасть" туда). Сертификат приходит в формате PDF. Спасибо что выбрали нас!',
            'error' => 'Ошибка активации сертификата. Обратитесь в тех. поддержку',
            'generation_error' => 'Ошибка генерации!',
            'code_missing' => 'Код активации не найден!',
            'code_invalid' => 'Неверный код активации!',
            'sms_invalid' => 'Не правильный SMS для номера!',
            'success_activation' => 'Успешная активация'
        ],

        'is_fraud' => [
            'blocked' => 'Блокировка',
            'fraud' => 'Fraud',
        ],

        'user_block' => 'Пользователь успешно Заблокирован'
    ]
];
